In [1]:
btuple = (1,5,8,9,4)

In [2]:
print(btuple)

(1, 5, 8, 9, 4)

# a list in a dictionary

In [3]:
python_class = {"students": ["Nasir", "Asad", "Ahmed", "Ali", "Qasim"],
                "Courses":["Pythone", "DA", "DS", "Python", "DA"],
                "Day":["Sat","Sun","Sat", "Sun","Sat"]}

In [4]:
print(python_class)

{'students': ['Nasir', 'Asad', 'Ahmed', 'Ali', 'Qasim'], 'Courses': ['Pythone', 'DA', 'DS', 'Python', 'DA'], 'Day': ['Sat', 'Sun', 'Sat', 'Sun', 'Sat']}

In [5]:
import pandas

In [6]:
pandas.DataFrame(python_class)

  students  Courses  Day
0    Nasir  Pythone  Sat
1     Asad       DA  Sun
2    Ahmed       DS  Sat
3      Ali   Python  Sun
4    Qasim       DA  Sat

In [7]:
python_class["students"]

['Nasir', 'Asad', 'Ahmed', 'Ali', 'Qasim']

In [10]:
python_class["students"][3]

'Ali'

In [13]:
python_class = {"students": ["Nasir", "Asad", "Ahmed", "Ali", "Qasim"],
                "Courses":["Pythone", "DA", "DS", "Python", "DA"],
                "Day":["Sat","Sun","Sat", "Sun","Sat"],
               "ExamMarks":{"test1":89,"test2":87,"test3":73}
               }

In [14]:
python_class["ExamMarks"]

{'test1': 89, 'test2': 87, 'test3': 73}

In [15]:
python_class["ExamMarks"]["test2"]

87

In [16]:
python_class

{'students': ['Nasir', 'Asad', 'Ahmed', 'Ali', 'Qasim'],
 'Courses': ['Pythone', 'DA', 'DS', 'Python', 'DA'],
 'Day': ['Sat', 'Sun', 'Sat', 'Sun', 'Sat'],
 'ExamMarks': {'test1': 89, 'test2': 87, 'test3': 73}}

In [21]:
python_class = {"students": ["Nasir", "Asad", "Ahmed", "Ali", "Qasim"],
                "Courses":["Pythone", "DA", "DS", "Python", "DA"],
                "Day":["Sat","Sun","Sat", "Sun","Sat"],
                "ExamMarks":[
                            {"test1":89,"test2":87,"test3":73},
                            {"test1":49,"test2":47,"test3":43},
                            {"test1":59,"test2":57,"test3":53},
                            {"test1":69,"test2":67,"test3":63},
                            {"test1":39,"test2":37,"test3":33}
                           ]
}

In [22]:
pandas.DataFrame(python_class)

  students  Courses  Day                                ExamMarks
0    Nasir  Pythone  Sat  {'test1': 89, 'test2': 87, 'test3': 73}
1     Asad       DA  Sun  {'test1': 49, 'test2': 47, 'test3': 43}
2    Ahmed       DS  Sat  {'test1': 59, 'test2': 57, 'test3': 53}
3      Ali   Python  Sun  {'test1': 69, 'test2': 67, 'test3': 63}
4    Qasim       DA  Sat  {'test1': 39, 'test2': 37, 'test3': 33}

In [25]:
python_class["ExamMarks"][3]

{'test1': 69, 'test2': 67, 'test3': 63}

In [31]:
a_set = set([2,3,5,4,5,6,8,7,9,2,4,58,6,58,2,2,3,4,7])

# Set

In [33]:
a={}
type(a)

dict

In [34]:
b={4}
type(b)

set

In [32]:
print(a_set)

{2, 3, 4, 5, 6, 7, 8, 9, 58}

In [30]:
set(2,3,5,4,5,6,8,7,9,2,4,58,6,58,2,2,3,4,7)

TypeError: set expected at most 1 argument, got 19